In [1]:
import pandas as pd
import numpy as np

In [2]:
dataframe1=pd.DataFrame([12345],dtype=int)
print(type(dataframe1))

<class 'pandas.core.frame.DataFrame'>

In [3]:
a=pd.Series([10,11,12,13,np.nan,14,15])
a

0    10.0
1    11.0
2    12.0
3    13.0
4     NaN
5    14.0
6    15.0
dtype: float64

In [4]:
d=pd.date_range("20230221",periods=10)
print(d)
print(type(d))

DatetimeIndex(['2023-02-21', '2023-02-22', '2023-02-23', '2023-02-24',
               '2023-02-25', '2023-02-26', '2023-02-27', '2023-02-28',
               '2023-03-01', '2023-03-02'],
              dtype='datetime64[ns]', freq='D')
<class 'pandas.core.indexes.datetimes.DatetimeIndex'>

In [6]:
df = pd.DataFrame(np.random.randn(10,4),index=d,columns=[1,2,3,4])
df

                   1         2         3         4
2023-02-21 -0.323347 -1.706565 -0.014820  1.018963
2023-02-22  1.651584  0.364085  0.837745  0.166816
2023-02-23  0.178265  1.388153 -0.875721  0.267024
2023-02-24 -0.342911  1.134256 -1.522517 -0.334522
2023-02-25 -0.701023 -0.631916 -0.360167 -1.063309
2023-02-26 -1.575763 -1.169007  1.234714 -1.199812
2023-02-27  0.065122  1.011975  0.528017 -0.731666
2023-02-28 -1.136644  0.635964 -0.362662  0.192305
2023-03-01 -1.389486 -1.172467  0.500847  0.136984
2023-03-02  0.755093  0.089185  0.295046 -0.801574

In [11]:
a=pd.DataFrame({"no":[1,2,3,4],
                "date":pd.date_range("20230222",periods=4),
               "series":pd.Series(3,index=list(range(4)),dtype="float32"),
               "array":pd.array([5]*4,dtype="int32"),
               "Categori":pd.Categorical(["true","false","true","false"])})
a

   no       date  series  array Categori
0   1 2023-02-22     3.0      5     true
1   2 2023-02-23     3.0      5    false
2   3 2023-02-24     3.0      5     true
3   4 2023-02-25     3.0      5    false

In [12]:
a.dtypes

no                   int64
date        datetime64[ns]
series             float32
array                int32
Categori          category
dtype: object

In [14]:
df.dtypes

1    float64
2    float64
3    float64
4    float64
dtype: object

In [15]:
df.head()

                   1         2         3         4
2023-02-21 -0.323347 -1.706565 -0.014820  1.018963
2023-02-22  1.651584  0.364085  0.837745  0.166816
2023-02-23  0.178265  1.388153 -0.875721  0.267024
2023-02-24 -0.342911  1.134256 -1.522517 -0.334522
2023-02-25 -0.701023 -0.631916 -0.360167 -1.063309

In [16]:
df.tail()

                   1         2         3         4
2023-02-26 -1.575763 -1.169007  1.234714 -1.199812
2023-02-27  0.065122  1.011975  0.528017 -0.731666
2023-02-28 -1.136644  0.635964 -0.362662  0.192305
2023-03-01 -1.389486 -1.172467  0.500847  0.136984
2023-03-02  0.755093  0.089185  0.295046 -0.801574

In [17]:
df.tail(2)

                   1         2         3         4
2023-03-01 -1.389486 -1.172467  0.500847  0.136984
2023-03-02  0.755093  0.089185  0.295046 -0.801574

In [19]:
df.index

DatetimeIndex(['2023-02-21', '2023-02-22', '2023-02-23', '2023-02-24',
               '2023-02-25', '2023-02-26', '2023-02-27', '2023-02-28',
               '2023-03-01', '2023-03-02'],
              dtype='datetime64[ns]', freq='D')

In [20]:
df.columns

Int64Index([1, 2, 3, 4], dtype='int64')

In [21]:
df.to_numpy()

array([[-0.32334721, -1.70656545, -0.01481975,  1.01896276],
       [ 1.65158448,  0.36408488,  0.83774468,  0.16681581],
       [ 0.17826478,  1.38815291, -0.87572146,  0.26702374],
       [-0.34291102,  1.13425591, -1.52251655, -0.33452193],
       [-0.70102267, -0.63191563, -0.36016673, -1.0633095 ],
       [-1.57576297, -1.16900746,  1.23471437, -1.19981184],
       [ 0.0651218 ,  1.01197517,  0.52801708, -0.73166608],
       [-1.13664442,  0.63596415, -0.36266216,  0.19230548],
       [-1.38948612, -1.17246705,  0.5008466 ,  0.13698395],
       [ 0.75509254,  0.08918457,  0.29504574, -0.80157439]])

In [22]:
df.describe()

               1          2          3          4
count  10.000000  10.000000  10.000000  10.000000
mean   -0.281911  -0.005634   0.026048  -0.234879
std     0.997687   1.097228   0.828832   0.707218
min    -1.575763  -1.706565  -1.522517  -1.199812
25%    -1.027739  -1.034735  -0.362038  -0.784097
50%    -0.333129   0.226635   0.140113  -0.098769
75%     0.149979   0.917972   0.521224   0.185933
max     1.651584   1.388153   1.234714   1.018963

In [74]:
df.sort_index(axis=1, ascending=False)

                   4         3         2         1
2023-02-21  1.018963 -0.014820 -1.706565 -0.323347
2023-02-22  0.166816  0.837745  0.364085  1.651584
2023-02-23  0.267024 -0.875721  1.388153  0.178265
2023-02-24 -0.334522 -1.522517  1.134256 -0.342911
2023-02-25 -1.063309 -0.360167 -0.631916 -0.701023
2023-02-26 -1.199812  1.234714 -1.169007 -1.575763
2023-02-27 -0.731666  0.528017  1.011975  0.065122
2023-02-28  0.192305 -0.362662  0.635964 -1.136644
2023-03-01  0.136984  0.500847 -1.172467 -1.389486
2023-03-02 -0.801574  0.295046  0.089185  0.755093

In [32]:
df.sort_values(by=3)

                   1         2         3         4
2023-02-24 -0.342911  1.134256 -1.522517 -0.334522
2023-02-23  0.178265  1.388153 -0.875721  0.267024
2023-02-28 -1.136644  0.635964 -0.362662  0.192305
2023-02-25 -0.701023 -0.631916 -0.360167 -1.063309
2023-02-21 -0.323347 -1.706565 -0.014820  1.018963
2023-03-02  0.755093  0.089185  0.295046 -0.801574
2023-03-01 -1.389486 -1.172467  0.500847  0.136984
2023-02-27  0.065122  1.011975  0.528017 -0.731666
2023-02-22  1.651584  0.364085  0.837745  0.166816
2023-02-26 -1.575763 -1.169007  1.234714 -1.199812

In [33]:
df[1]

2023-02-21   -0.323347
2023-02-22    1.651584
2023-02-23    0.178265
2023-02-24   -0.342911
2023-02-25   -0.701023
2023-02-26   -1.575763
2023-02-27    0.065122
2023-02-28   -1.136644
2023-03-01   -1.389486
2023-03-02    0.755093
Freq: D, Name: 1, dtype: float64

In [34]:
df[0:2]

                   1         2         3         4
2023-02-21 -0.323347 -1.706565 -0.014820  1.018963
2023-02-22  1.651584  0.364085  0.837745  0.166816

In [35]:
df.loc[d[0]]

1   -0.323347
2   -1.706565
3   -0.014820
4    1.018963
Name: 2023-02-21 00:00:00, dtype: float64

In [36]:
df.loc[:,[1,3]]

                   1         3
2023-02-21 -0.323347 -0.014820
2023-02-22  1.651584  0.837745
2023-02-23  0.178265 -0.875721
2023-02-24 -0.342911 -1.522517
2023-02-25 -0.701023 -0.360167
2023-02-26 -1.575763  1.234714
2023-02-27  0.065122  0.528017
2023-02-28 -1.136644 -0.362662
2023-03-01 -1.389486  0.500847
2023-03-02  0.755093  0.295046

In [38]:
df.loc["20230225":"20230301",[2,4]]

                   2         4
2023-02-25 -0.631916 -1.063309
2023-02-26 -1.169007 -1.199812
2023-02-27  1.011975 -0.731666
2023-02-28  0.635964  0.192305
2023-03-01 -1.172467  0.136984

In [39]:
df.loc[d[0],[3,1]]

3   -0.014820
1   -0.323347
Name: 2023-02-21 00:00:00, dtype: float64

In [40]:
df.iloc[3]

1   -0.342911
2    1.134256
3   -1.522517
4   -0.334522
Name: 2023-02-24 00:00:00, dtype: float64

In [42]:
df.loc[d[3]]

1   -0.342911
2    1.134256
3   -1.522517
4   -0.334522
Name: 2023-02-24 00:00:00, dtype: float64

In [43]:
df.iloc[3:5]

                   1         2         3         4
2023-02-24 -0.342911  1.134256 -1.522517 -0.334522
2023-02-25 -0.701023 -0.631916 -0.360167 -1.063309

In [45]:
df.iloc[3:5,1:3]

                   2         3
2023-02-24  1.134256 -1.522517
2023-02-25 -0.631916 -0.360167

In [47]:
df[df[2]>0]

                   1         2         3         4
2023-02-22  1.651584  0.364085  0.837745  0.166816
2023-02-23  0.178265  1.388153 -0.875721  0.267024
2023-02-24 -0.342911  1.134256 -1.522517 -0.334522
2023-02-27  0.065122  1.011975  0.528017 -0.731666
2023-02-28 -1.136644  0.635964 -0.362662  0.192305
2023-03-02  0.755093  0.089185  0.295046 -0.801574

In [48]:
df[df[2]>1]

                   1         2         3         4
2023-02-23  0.178265  1.388153 -0.875721  0.267024
2023-02-24 -0.342911  1.134256 -1.522517 -0.334522
2023-02-27  0.065122  1.011975  0.528017 -0.731666

In [53]:
df2=df.reindex(index=d[0:5],columns=list(df.columns)+[5])
df2.loc[d[0]:d[2], 5]=1
df2

                   1         2         3         4    5
2023-02-21 -0.323347 -1.706565 -0.014820  1.018963  1.0
2023-02-22  1.651584  0.364085  0.837745  0.166816  1.0
2023-02-23  0.178265  1.388153 -0.875721  0.267024  1.0
2023-02-24 -0.342911  1.134256 -1.522517 -0.334522  NaN
2023-02-25 -0.701023 -0.631916 -0.360167 -1.063309  NaN

In [54]:
df2.isnull()

                1      2      3      4      5
2023-02-21  False  False  False  False  False
2023-02-22  False  False  False  False  False
2023-02-23  False  False  False  False  False
2023-02-24  False  False  False  False   True
2023-02-25  False  False  False  False   True

In [56]:
df2.dropna()

                   1         2         3         4    5
2023-02-21 -0.323347 -1.706565 -0.014820  1.018963  1.0
2023-02-22  1.651584  0.364085  0.837745  0.166816  1.0
2023-02-23  0.178265  1.388153 -0.875721  0.267024  1.0

In [57]:
df2.fillna(value=5)

                   1         2         3         4    5
2023-02-21 -0.323347 -1.706565 -0.014820  1.018963  1.0
2023-02-22  1.651584  0.364085  0.837745  0.166816  1.0
2023-02-23  0.178265  1.388153 -0.875721  0.267024  1.0
2023-02-24 -0.342911  1.134256 -1.522517 -0.334522  5.0
2023-02-25 -0.701023 -0.631916 -0.360167 -1.063309  5.0

In [59]:
df2.mean()

1    0.092514
2    0.109603
3   -0.387096
4    0.010994
5    1.000000
dtype: float64

In [62]:
s = pd.Series([1,2,3,np.nan,4,5,6,7,8,9], index=d).shift(3)
s

2023-02-21    NaN
2023-02-22    NaN
2023-02-23    NaN
2023-02-24    1.0
2023-02-25    2.0
2023-02-26    3.0
2023-02-27    NaN
2023-02-28    4.0
2023-03-01    5.0
2023-03-02    6.0
Freq: D, dtype: float64

In [70]:
b=df.sub(s, axis="index")
print(s)
print(df)
print(b)

2023-02-21    NaN
2023-02-22    NaN
2023-02-23    NaN
2023-02-24    1.0
2023-02-25    2.0
2023-02-26    3.0
2023-02-27    NaN
2023-02-28    4.0
2023-03-01    5.0
2023-03-02    6.0
Freq: D, dtype: float64
                   1         2         3         4
2023-02-21 -0.323347 -1.706565 -0.014820  1.018963
2023-02-22  1.651584  0.364085  0.837745  0.166816
2023-02-23  0.178265  1.388153 -0.875721  0.267024
2023-02-24 -0.342911  1.134256 -1.522517 -0.334522
2023-02-25 -0.701023 -0.631916 -0.360167 -1.063309
2023-02-26 -1.575763 -1.169007  1.234714 -1.199812
2023-02-27  0.065122  1.011975  0.528017 -0.731666
2023-02-28 -1.136644  0.635964 -0.362662  0.192305
2023-03-01 -1.389486 -1.172467  0.500847  0.136984
2023-03-02  0.755093  0.089185  0.295046 -0.801574
                   1         2         3         4
2023-02-21       NaN       NaN       NaN       NaN
2023-02-22       NaN       NaN       NaN       NaN
2023-02-23       NaN       NaN       NaN       NaN
2023-02-24 -1.342911  0.134256 -2.522517 -1.334522
2023-02-25 -2.701023 -2.631916 -2.360167 -3.063309
2023-02-26 -4.575763 -4.169007 -1.765286 -4.199812
2023-02-27       NaN       NaN       NaN       NaN
2023-02-28 -5.136644 -3.364036 -4.362662 -3.807695
2023-03-01 -6.389486 -6.172467 -4.499153 -4.863016
2023-03-02 -5.244907 -5.910815 -5.704954 -6.801574

In [89]:
a=pd.DataFrame({"a":[1,2,3,4],
                "b":[0,5,8,9],
               "c":[9,8,7,5],
               "d":[4,5,6,8],
               "e":[7,5,0,3]})
print(a)

   a  b  c  d  e
0  1  0  9  4  7
1  2  5  8  5  5
2  3  8  7  6  0
3  4  9  5  8  3

In [91]:
s = pd.Series([1,2,3,4]).shift(1)
s

0    NaN
1    1.0
2    2.0
3    3.0
dtype: float64

In [106]:
a.sub(s,axis=0)

     a    b    c    d    e
0  NaN  NaN  NaN  NaN  NaN
1  1.0  4.0  7.0  4.0  4.0
2  1.0  6.0  5.0  4.0 -2.0
3  1.0  6.0  2.0  5.0  0.0

In [102]:
import pandas as pd
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})
column_sum = df.sum(axis=0)
row_sum = df.sum(axis=1)
print(df)
print(column_sum)
print(row_sum)

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9
A     6
B    15
C    24
dtype: int64
0    12
1    15
2    18
dtype: int64

In [107]:
x=pd.DataFrame({"a":[1,2,3,4],
                "b":[0,5,8,9],
               "c":[9,8,7,5],
               "d":[4,5,6,8],
               "e":[7,5,0,3]})
print(x)

   a  b  c  d  e
0  1  0  9  4  7
1  2  5  8  5  5
2  3  8  7  6  0
3  4  9  5  8  3

In [108]:
a.sub(x)

   a  b  c  d  e
0  0  0  0  0  0
1  0  0  0  0  0
2  0  0  0  0  0
3  0  0  0  0  0